# -*- coding: utf-8 -*-
# __athor__ = tyx

pro_city = [(u'黑龙江', u'哈尔滨市'),

            (u'吉林省', u'长春市'),

            (u'吉林省', u'吉林市'),

            (u'云南省', u'昆明市'),

            (u'江苏省', u'南京市'),

            (u'江西省', u'南昌市'),

            (u'山西省', u'太原市'),

            (u'安徽省', u'合肥市'),

            (u'湖北省', u'武汉市'),

            (u'贵州省', u'贵阳市'),

            (u'中国香港', u'香港'),

            (u'辽宁省', u'沈阳市'),

            (u'福建省', u'福州市'),

            (u'新疆', u'乌鲁木齐市'),

            (u'上海市', u'上海'),

            (u'宁夏', u'银川市'),

            (u'西藏', u'拉萨市'),

            (u'河南省', u'郑州市'),

            (u'海南省', u'海口市'),

            (u'青海', u'西宁市'),

            (u'中国台湾', u'台北市'),

            (u'北京市', u'北京'),

            (u'广东省', u'广州市'),

            (u'天津市', u'天津'),

            (u'四川省', u'成都市'),

            (u'重庆市', u'重庆'),

            (u'甘肃省', u'兰州市'),

            (u'广西', u'南宁市'),

            (u'河北省', u'石家庄市'),

            (u'内蒙古', u'呼和浩特市'),

            (u'中国澳门', u'奥门'),

            (u'湖南省', u'长沙市'),

            (u'山东省', u'济南市'),

            (u'陕西省', u'西安市'),

            (u'浙江省', u'杭州市'),

            (u'青海', u'海东市'),

            (u'山西省', u'大同市'),

            (u'宁夏', u'石嘴山市'),

            (u'新疆', u'石河子市'),

            (u'河南省', u'开封市'),

            (u'山东省', u'青岛市'),

            (u'海南省', u'三亚市'),

            (u'四川省', u'绵阳市'),

            (u'河北省', u'邯郸市'),

            (u'中国台湾', u'高雄市'),

            (u'江苏省', u'镇江市'),

            (u'广东省', u'深圳市'),

            (u'江西省', u'景德镇市'),

            (u'甘肃省', u'嘉峪关市'),

            (u'福建省', u'厦门市'),

            (u'浙江省', u'宁波市'),

            (u'湖南省', u'常德市'),

            (u'陕西省', u'宝鸡市'),

            (u'内蒙古', u'包头市'),

            (u'辽宁省', u'大连市'),

            (u'广西', u'柳州市'),

            (u'贵州省', u'六盘水市'),

            (u'黑龙江', u'齐齐哈尔市'),

            (u'湖北省', u'宜昌市'),

            (u'西藏', u'日喀则市'),

            (u'安徽省', u'芜湖市'),

            (u'云南省', u'大理市'),

            (u'辽宁省', u'鞍山市'),

            (u'江西省', u'九江市'),

            (u'福建省', u'莆田市'),

            (u'山西省', u'阳泉市'),

            (u'黑龙江', u'牡丹江市'),

            (u'浙江省', u'温州市'),

            (u'江苏省', u'苏州市'),

            (u'吉林省', u'四平市'),

            (u'安徽省', u'蚌埠市'),

            (u'宁夏', u'吴忠市'),

            (u'湖北省', u'荆州市'),

            (u'贵州省', u'遵义市'),

            (u'内蒙古', u'乌海市'),

            (u'四川省', u'德阳市'),

            (u'西藏', u'山南市'),

            (u'广西', u'桂林市'),

            (u'河南省', u'洛阳市'),

            (u'云南省', u'曲靖市'),

            (u'湖南省', u'株洲市'),

            (u'河北省', u'邢台市'),

            (u'青海', u'海南市'),

            (u'甘肃省', u'金昌市'),

            (u'新疆', u'克拉玛依市'),

            (u'山东省', u'淄博市'),

            (u'中国台湾', u'台中市'),

            (u'广东省', u'珠海市'),

            (u'陕西省', u'咸阳市'),

            (u'甘肃省', u'白银市'),

            (u'江苏省', u'南通市'),

            (u'陕西省', u'铜川市'),

            (u'广东省', u'汕头市'),

            (u'内蒙古', u'集宁市'),

            (u'黑龙江', u'佳木斯市'),

            (u'广西', u'梧州市'),

            (u'四川省', u'自贡市'),

            (u'青海', u'海北市'),

            (u'吉林省', u'辽源市'),

            (u'云南省', u'玉溪市'),

            (u'辽宁省', u'抚顺市'),

            (u'西藏', u'林芝市'),

            (u'山西省', u'长治市'),

            (u'宁夏', u'固原市'),

            (u'河北省', u'保定市'),

            (u'新疆', u'伊犁市'),

            (u'中国台湾', u'台南市'),

            (u'贵州省', u'安顺市'),

            (u'浙江省', u'嘉兴市'),

            (u'湖南省', u'湘潭市'),

            (u'安徽省', u'马鞍山市'),

            (u'山东省', u'枣庄市'),

            (u'河南省', u'平顶山市'),

            (u'福建省', u'三明市'),

            (u'湖北省', u'襄阳市'),

            (u'江西省', u'鹰潭市'),

            (u'河北省', u'张家口市'),

            (u'广西', u'北海市'),

            (u'山西省', u'晋城市'),

            (u'四川省', u'攀枝花市'),

            (u'青海', u'黄南市'),

            (u'广东省', u'东莞市'),

            (u'黑龙江', u'大庆市'),

            (u'安徽省', u'淮北市'),

            (u'贵州省', u'铜仁市'),

            (u'西藏', u'昌都市'),

            (u'江西省', u'萍乡市'),

            (u'河南省', u'安阳市'),

            (u'辽宁省', u'本溪市'),

            (u'吉林省', u'通化市'),

            (u'浙江省', u'湖州市'),

            (u'湖南省', u'衡阳市'),

            (u'甘肃省', u'天水市'),

            (u'福建省', u'泉州市'),

            (u'陕西省', u'渭南市'),

            (u'江苏省', u'扬州市'),

            (u'云南省', u'昭通市'),

            (u'中国台湾', u'屏东市'),

            (u'内蒙古', u'通辽市'),

            (u'新疆', u'巴音郭勒市'),

            (u'山东省', u'东营市'),

            (u'湖北省', u'黄石市'),

            (u'河北省', u'承德市'),

            (u'新疆', u'昌吉市'),

            (u'山东省', u'烟台市'),

            (u'山西省', u'朔州市'),

            (u'西藏', u'阿里市'),

            (u'福建省', u'漳州市'),

            (u'河南省', u'鹤壁市'),

            (u'江西省', u'新馀市'),

            (u'辽宁省', u'丹东市'),

            (u'中国台湾', u'南投市'),

            (u'黑龙江', u'绥化市'),

            (u'湖南省', u'岳阳市'),

            (u'甘肃省', u'酒泉市'),

            (u'江苏省', u'盐城市'),

            (u'浙江省', u'绍兴市'),

            (u'陕西省', u'延安市'),

            (u'内蒙古', u'赤峰市'),

            (u'湖北省', u'荆门市'),

            (u'广西', u'防城港市'),

            (u'四川省', u'广元市'),

            (u'吉林省', u'白山市'),

            (u'广东省', u'中山市'),

            (u'安徽省', u'铜陵市'),

            (u'云南省', u'楚雄市'),

            (u'贵州省', u'黔西南市'),

            (u'青海', u'玉树市'),

            (u'新疆', u'克孜勒苏柯尔克孜市'),

            (u'湖南省', u'邵阳市'),

            (u'云南省', u'红河市'),

            (u'甘肃省', u'张掖市'),

            (u'中国台湾', u'云林市'),

            (u'陕西省', u'榆林市'),

            (u'山东省', u'潍坊市'),

            (u'西藏', u'那曲市'),

            (u'四川省', u'内江市'),

            (u'内蒙古', u'呼伦贝尔盟'),

            (u'湖北省', u'黄冈市'),

            (u'贵州省', u'毕节市'),

            (u'广东省', u'佛山市'),

            (u'河南省', u'新乡市'),

            (u'青海', u'果洛市'),

            (u'广西', u'钦州市'),

            (u'江西省', u'赣州市'),

            (u'辽宁省', u'锦州市'),

            (u'黑龙江', u'鹤岗市'),

            (u'山西省', u'吕梁市'),

            (u'福建省', u'南平市'),

            (u'吉林省', u'松原市'),

            (u'江苏省', u'徐州市'),

            (u'浙江省', u'金华市'),

            (u'河北省', u'廊坊市'),

            (u'安徽省', u'安庆市'),

            (u'湖北省', u'十堰市'),

            (u'内蒙古', u'阿拉善盟'),

            (u'贵州省', u'黔东南市'),

            (u'山西省', u'忻州市'),

            (u'甘肃省', u'武威市'),

            (u'江苏省', u'连云港市'),

            (u'辽宁省', u'营口市'),

            (u'云南省', u'文山市'),

            (u'山东省', u'济宁市'),

            (u'安徽省', u'黄山市'),

            (u'河南省', u'焦作市'),

            (u'浙江省', u'衢州市'),

            (u'广东省', u'韶关市'),

            (u'陕西省', u'汉中市'),

            (u'四川省', u'乐山市'),

            (u'吉林省', u'白城市'),

            (u'广西', u'贵港市'),

            (u'黑龙江', u'鸡西市'),

            (u'青海', u'海西市'),

            (u'湖南省', u'益阳市'),

            (u'新疆', u'博尔塔拉市'),

            (u'中国台湾', u'新竹市'),

            (u'福建省', u'龙岩市'),

            (u'河北省', u'唐山市'),

            (u'江西省', u'吉安市'),

            (u'吉林省', u'延边市'),

            (u'广东省', u'江门市'),

            (u'江西省', u'宜春市'),

            (u'广西', u'玉林市'),

            (u'辽宁省', u'阜新市'),

            (u'河南省', u'濮阳市'),

            (u'浙江省', u'舟山市'),

            (u'湖北省', u'恩施市'),

            (u'山西省', u'晋中市'),

            (u'云南省', u'思茅市'),

            (u'安徽省', u'滁州市'),

            (u'新疆', u'吐鲁番市'),

            (u'河北省', u'秦皇岛市'),

            (u'陕西省', u'安康市'),

            (u'内蒙古', u'哲里木盟'),

            (u'黑龙江', u'黑河市'),

            (u'江苏省', u'常州市'),

            (u'湖南省', u'娄底市'),

            (u'中国台湾', u'彰化市'),

            (u'甘肃省', u'定西市'),

            (u'山东省', u'泰安市'),

            (u'四川省', u'南充市'),

            (u'福建省', u'宁德市'),

            (u'贵州省', u'黔南市'),

            (u'四川省', u'宜宾市'),

            (u'辽宁省', u'辽阳市'),

            (u'陕西省', u'商洛市'),

            (u'广东省', u'湛江市'),

            (u'中国台湾', u'苗栗市'),

            (u'甘肃省', u'陇南市'),

            (u'河北省', u'沧州市'),

            (u'内蒙古', u'兴安盟'),

            (u'江苏省', u'无锡市'),

            (u'新疆', u'哈密市'),

            (u'湖北省', u'潜江市'),

            (u'山东省', u'威海市'),

            (u'黑龙江', u'双鸭山市'),

            (u'云南省', u'西双版纳市'),

            (u'山西省', u'临汾市'),

            (u'湖南省', u'怀化市'),

            (u'浙江省', u'台州市'),

            (u'安徽省', u'宿州市'),

            (u'河南省', u'许昌市'),

            (u'江西省', u'抚州市'),

            (u'广西', u'贺州市'),

            (u'浙江省', u'丽水市'),

            (u'四川省', u'广安市'),

            (u'内蒙古', u'乌兰察布盟'),

            (u'广西', u'百色市'),

            (u'湖北省', u'天门市'),

            (u'河南省', u'漯河市'),

            (u'江西省', u'上饶市'),

            (u'山西省', u'运城市'),

            (u'广东省', u'茂名市'),

            (u'甘肃省', u'平凉市'),

            (u'云南省', u'保山市'),

            (u'江苏省', u'宿迁市'),

            (u'安徽省', u'池州市'),

            (u'山东省', u'日照市'),

            (u'黑龙江', u'伊春市'),

            (u'新疆', u'喀什市'),

            (u'湖南省', u'郴州市'),

            (u'中国台湾', u'嘉义市'),

            (u'河北省', u'衡水市'),

            (u'辽宁省', u'盘锦市'),

            (u'新疆', u'和田市'),

            (u'内蒙古', u'锡林郭勒盟'),

            (u'山东省', u'莱芜市'),

            (u'湖南省', u'永州市'),

            (u'安徽省', u'淮南市'),

            (u'河南省', u'三门峡市'),

            (u'云南省', u'德宏市'),

            (u'黑龙江', u'七台河市'),

            (u'广西', u'河池市'),

            (u'辽宁省', u'铁岭市'),

            (u'广东省', u'肇庆市'),

            (u'湖北省', u'仙桃市'),

            (u'江苏省', u'泰州市'),

            (u'四川省', u'达川市'),

            (u'中国台湾', u'花莲市'),

            (u'甘肃省', u'庆阳市'),

            (u'甘肃省', u'临夏市'),

            (u'江苏省', u'淮安市'),

            (u'广东省', u'惠州市'),

            (u'湖北省', u'随州市'),

            (u'湖南省', u'湘西市'),

            (u'安徽省', u'巢湖市'),

            (u'新疆', u'阿克苏市'),

            (u'云南省', u'丽江市'),

            (u'黑龙江', u'大兴安岭市'),

            (u'河南省', u'南阳市'),

            (u'山东省', u'临沂市'),

            (u'中国台湾', u'桃园市'),

            (u'四川省', u'雅安市'),

            (u'内蒙古', u'巴彦淖尔盟'),

            (u'辽宁省', u'朝阳市'),

            (u'湖南省', u'张家界市'),

            (u'中国台湾', u'宜兰市'),

            (u'广东省', u'梅州市'),

            (u'安徽省', u'阜阳市'),

            (u'辽宁省', u'葫芦岛市'),

            (u'湖北省', u'咸宁市'),

            (u'内蒙古', u'伊克昭盟'),

            (u'四川省', u'眉山市'),

            (u'河南省', u'信阳市'),

            (u'山东省', u'德州市'),

            (u'甘肃省', u'甘南市'),

            (u'云南省', u'怒江市'),

            (u'湖北省', u'孝感市'),

            (u'安徽省', u'六安市'),

            (u'山东省', u'聊城市'),

            (u'云南省', u'迪庆市'),

            (u'四川省', u'甘孜市'),

            (u'中国台湾', u'基隆市'),

            (u'广东省', u'汕尾市'),

            (u'河南省', u'周口市'),

            (u'广东省', u'河源市'),

            (u'河南省', u'驻马店市'),

            (u'安徽省', u'宣城市'),

            (u'中国台湾', u'台东市'),

            (u'云南省', u'临沧市'),

            (u'四川省', u'凉山市'),

            (u'湖北省', u'鄂州市'),

            (u'山东省', u'滨州市'),

            (u'河南省', u'济源市'),

            (u'四川省', u'泸州市'),

            (u'广东省', u'阳江市'),

            (u'山东省', u'菏泽市'),

            (u'中国台湾', u'金门市'),

            (u'安徽省', u'亳州市'),

            (u'中国台湾', u'马祖市'),

            (u'四川省', u'遂宁市'),

            (u'广东省', u'清远市'),

            (u'广东省', u'潮州市'),

            (u'中国台湾', u'澎湖市'),

            (u'广东省', u'揭阳市'),

            (u'广东省', u'云浮市'), ]

mysql_config = {"host": "localhost", "user": "root", "password": "", "db": "test", "charset": "utf8"}
