# -*- coding: utf-8 -*-
# __athor__ = tyx

pro_city = [('黑龙江', '哈尔滨市'),

            ('吉林省', '长春市'),

            ('吉林省', '吉林市'),

            ('云南省', '昆明市'),

            ('江苏省', '南京市'),

            ('江西省', '南昌市'),

            ('山西省', '太原市'),

            ('安徽省', '合肥市'),

            ('湖北省', '武汉市'),

            ('贵州省', '贵阳市'),

            ('中国香港', '香港'),

            ('辽宁省', '沈阳市'),

            ('福建省', '福州市'),

            ('新疆', '乌鲁木齐市'),

            ('上海市', '上海'),

            ('宁夏', '银川市'),

            ('西藏', '拉萨市'),

            ('河南省', '郑州市'),

            ('海南省', '海口市'),

            ('青海', '西宁市'),

            ('中国台湾', '台北市'),

            ('北京市', '北京'),

            ('广东省', '广州市'),

            ('天津市', '天津'),

            ('四川省', '成都市'),

            ('重庆市', '重庆'),

            ('甘肃省', '兰州市'),

            ('广西', '南宁市'),

            ('河北省', '石家庄市'),

            ('内蒙古', '呼和浩特市'),

            ('中国澳门', '奥门'),

            ('湖南省', '长沙市'),

            ('山东省', '济南市'),

            ('陕西省', '西安市'),

            ('浙江省', '杭州市'),

            ('青海', '海东市'),

            ('山西省', '大同市'),

            ('宁夏', '石嘴山市'),

            ('新疆', '石河子市'),

            ('河南省', '开封市'),

            ('山东省', '青岛市'),

            ('海南省', '三亚市'),

            ('四川省', '绵阳市'),

            ('河北省', '邯郸市'),

            ('中国台湾', '高雄市'),

            ('江苏省', '镇江市'),

            ('广东省', '深圳市'),

            ('江西省', '景德镇市'),

            ('甘肃省', '嘉峪关市'),

            ('福建省', '厦门市'),

            ('浙江省', '宁波市'),

            ('湖南省', '常德市'),

            ('陕西省', '宝鸡市'),

            ('内蒙古', '包头市'),

            ('辽宁省', '大连市'),

            ('广西', '柳州市'),

            ('贵州省', '六盘水市'),

            ('黑龙江', '齐齐哈尔市'),

            ('湖北省', '宜昌市'),

            ('西藏', '日喀则市'),

            ('安徽省', '芜湖市'),

            ('云南省', '大理市'),

            ('辽宁省', '鞍山市'),

            ('江西省', '九江市'),

            ('福建省', '莆田市'),

            ('山西省', '阳泉市'),

            ('黑龙江', '牡丹江市'),

            ('浙江省', '温州市'),

            ('江苏省', '苏州市'),

            ('吉林省', '四平市'),

            ('安徽省', '蚌埠市'),

            ('宁夏', '吴忠市'),

            ('湖北省', '荆州市'),

            ('贵州省', '遵义市'),

            ('内蒙古', '乌海市'),

            ('四川省', '德阳市'),

            ('西藏', '山南市'),

            ('广西', '桂林市'),

            ('河南省', '洛阳市'),

            ('云南省', '曲靖市'),

            ('湖南省', '株洲市'),

            ('河北省', '邢台市'),

            ('青海', '海南市'),

            ('甘肃省', '金昌市'),

            ('新疆', '克拉玛依市'),

            ('山东省', '淄博市'),

            ('中国台湾', '台中市'),

            ('广东省', '珠海市'),

            ('陕西省', '咸阳市'),

            ('甘肃省', '白银市'),

            ('江苏省', '南通市'),

            ('陕西省', '铜川市'),

            ('广东省', '汕头市'),

            ('内蒙古', '集宁市'),

            ('黑龙江', '佳木斯市'),

            ('广西', '梧州市'),

            ('四川省', '自贡市'),

            ('青海', '海北市'),

            ('吉林省', '辽源市'),

            ('云南省', '玉溪市'),

            ('辽宁省', '抚顺市'),

            ('西藏', '林芝市'),

            ('山西省', '长治市'),

            ('宁夏', '固原市'),

            ('河北省', '保定市'),

            ('新疆', '伊犁市'),

            ('中国台湾', '台南市'),

            ('贵州省', '安顺市'),

            ('浙江省', '嘉兴市'),

            ('湖南省', '湘潭市'),

            ('安徽省', '马鞍山市'),

            ('山东省', '枣庄市'),

            ('河南省', '平顶山市'),

            ('福建省', '三明市'),

            ('湖北省', '襄阳市'),

            ('江西省', '鹰潭市'),

            ('河北省', '张家口市'),

            ('广西', '北海市'),

            ('山西省', '晋城市'),

            ('四川省', '攀枝花市'),

            ('青海', '黄南市'),

            ('广东省', '东莞市'),

            ('黑龙江', '大庆市'),

            ('安徽省', '淮北市'),

            ('贵州省', '铜仁市'),

            ('西藏', '昌都市'),

            ('江西省', '萍乡市'),

            ('河南省', '安阳市'),

            ('辽宁省', '本溪市'),

            ('吉林省', '通化市'),

            ('浙江省', '湖州市'),

            ('湖南省', '衡阳市'),

            ('甘肃省', '天水市'),

            ('福建省', '泉州市'),

            ('陕西省', '渭南市'),

            ('江苏省', '扬州市'),

            ('云南省', '昭通市'),

            ('中国台湾', '屏东市'),

            ('内蒙古', '通辽市'),

            ('新疆', '巴音郭勒市'),

            ('山东省', '东营市'),

            ('湖北省', '黄石市'),

            ('河北省', '承德市'),

            ('新疆', '昌吉市'),

            ('山东省', '烟台市'),

            ('山西省', '朔州市'),

            ('西藏', '阿里市'),

            ('福建省', '漳州市'),

            ('河南省', '鹤壁市'),

            ('江西省', '新馀市'),

            ('辽宁省', '丹东市'),

            ('中国台湾', '南投市'),

            ('黑龙江', '绥化市'),

            ('湖南省', '岳阳市'),

            ('甘肃省', '酒泉市'),

            ('江苏省', '盐城市'),

            ('浙江省', '绍兴市'),

            ('陕西省', '延安市'),

            ('内蒙古', '赤峰市'),

            ('湖北省', '荆门市'),

            ('广西', '防城港市'),

            ('四川省', '广元市'),

            ('吉林省', '白山市'),

            ('广东省', '中山市'),

            ('安徽省', '铜陵市'),

            ('云南省', '楚雄市'),

            ('贵州省', '黔西南市'),

            ('青海', '玉树市'),

            ('新疆', '克孜勒苏柯尔克孜市'),

            ('湖南省', '邵阳市'),

            ('云南省', '红河市'),

            ('甘肃省', '张掖市'),

            ('中国台湾', '云林市'),

            ('陕西省', '榆林市'),

            ('山东省', '潍坊市'),

            ('西藏', '那曲市'),

            ('四川省', '内江市'),

            ('内蒙古', '呼伦贝尔盟'),

            ('湖北省', '黄冈市'),

            ('贵州省', '毕节市'),

            ('广东省', '佛山市'),

            ('河南省', '新乡市'),

            ('青海', '果洛市'),

            ('广西', '钦州市'),

            ('江西省', '赣州市'),

            ('辽宁省', '锦州市'),

            ('黑龙江', '鹤岗市'),

            ('山西省', '吕梁市'),

            ('福建省', '南平市'),

            ('吉林省', '松原市'),

            ('江苏省', '徐州市'),

            ('浙江省', '金华市'),

            ('河北省', '廊坊市'),

            ('安徽省', '安庆市'),

            ('湖北省', '十堰市'),

            ('内蒙古', '阿拉善盟'),

            ('贵州省', '黔东南市'),

            ('山西省', '忻州市'),

            ('甘肃省', '武威市'),

            ('江苏省', '连云港市'),

            ('辽宁省', '营口市'),

            ('云南省', '文山市'),

            ('山东省', '济宁市'),

            ('安徽省', '黄山市'),

            ('河南省', '焦作市'),

            ('浙江省', '衢州市'),

            ('广东省', '韶关市'),

            ('陕西省', '汉中市'),

            ('四川省', '乐山市'),

            ('吉林省', '白城市'),

            ('广西', '贵港市'),

            ('黑龙江', '鸡西市'),

            ('青海', '海西市'),

            ('湖南省', '益阳市'),

            ('新疆', '博尔塔拉市'),

            ('中国台湾', '新竹市'),

            ('福建省', '龙岩市'),

            ('河北省', '唐山市'),

            ('江西省', '吉安市'),

            ('吉林省', '延边市'),

            ('广东省', '江门市'),

            ('江西省', '宜春市'),

            ('广西', '玉林市'),

            ('辽宁省', '阜新市'),

            ('河南省', '濮阳市'),

            ('浙江省', '舟山市'),

            ('湖北省', '恩施市'),

            ('山西省', '晋中市'),

            ('云南省', '思茅市'),

            ('安徽省', '滁州市'),

            ('新疆', '吐鲁番市'),

            ('河北省', '秦皇岛市'),

            ('陕西省', '安康市'),

            ('内蒙古', '哲里木盟'),

            ('黑龙江', '黑河市'),

            ('江苏省', '常州市'),

            ('湖南省', '娄底市'),

            ('中国台湾', '彰化市'),

            ('甘肃省', '定西市'),

            ('山东省', '泰安市'),

            ('四川省', '南充市'),

            ('福建省', '宁德市'),

            ('贵州省', '黔南市'),

            ('四川省', '宜宾市'),

            ('辽宁省', '辽阳市'),

            ('陕西省', '商洛市'),

            ('广东省', '湛江市'),

            ('中国台湾', '苗栗市'),

            ('甘肃省', '陇南市'),

            ('河北省', '沧州市'),

            ('内蒙古', '兴安盟'),

            ('江苏省', '无锡市'),

            ('新疆', '哈密市'),

            ('湖北省', '潜江市'),

            ('山东省', '威海市'),

            ('黑龙江', '双鸭山市'),

            ('云南省', '西双版纳市'),

            ('山西省', '临汾市'),

            ('湖南省', '怀化市'),

            ('浙江省', '台州市'),

            ('安徽省', '宿州市'),

            ('河南省', '许昌市'),

            ('江西省', '抚州市'),

            ('广西', '贺州市'),

            ('浙江省', '丽水市'),

            ('四川省', '广安市'),

            ('内蒙古', '乌兰察布盟'),

            ('广西', '百色市'),

            ('湖北省', '天门市'),

            ('河南省', '漯河市'),

            ('江西省', '上饶市'),

            ('山西省', '运城市'),

            ('广东省', '茂名市'),

            ('甘肃省', '平凉市'),

            ('云南省', '保山市'),

            ('江苏省', '宿迁市'),

            ('安徽省', '池州市'),

            ('山东省', '日照市'),

            ('黑龙江', '伊春市'),

            ('新疆', '喀什市'),

            ('湖南省', '郴州市'),

            ('中国台湾', '嘉义市'),

            ('河北省', '衡水市'),

            ('辽宁省', '盘锦市'),

            ('新疆', '和田市'),

            ('内蒙古', '锡林郭勒盟'),

            ('山东省', '莱芜市'),

            ('湖南省', '永州市'),

            ('安徽省', '淮南市'),

            ('河南省', '三门峡市'),

            ('云南省', '德宏市'),

            ('黑龙江', '七台河市'),

            ('广西', '河池市'),

            ('辽宁省', '铁岭市'),

            ('广东省', '肇庆市'),

            ('湖北省', '仙桃市'),

            ('江苏省', '泰州市'),

            ('四川省', '达川市'),

            ('中国台湾', '花莲市'),

            ('甘肃省', '庆阳市'),

            ('甘肃省', '临夏市'),

            ('江苏省', '淮安市'),

            ('广东省', '惠州市'),

            ('湖北省', '随州市'),

            ('湖南省', '湘西市'),

            ('安徽省', '巢湖市'),

            ('新疆', '阿克苏市'),

            ('云南省', '丽江市'),

            ('黑龙江', '大兴安岭市'),

            ('河南省', '南阳市'),

            ('山东省', '临沂市'),

            ('中国台湾', '桃园市'),

            ('四川省', '雅安市'),

            ('内蒙古', '巴彦淖尔盟'),

            ('辽宁省', '朝阳市'),

            ('湖南省', '张家界市'),

            ('中国台湾', '宜兰市'),

            ('广东省', '梅州市'),

            ('安徽省', '阜阳市'),

            ('辽宁省', '葫芦岛市'),

            ('湖北省', '咸宁市'),

            ('内蒙古', '伊克昭盟'),

            ('四川省', '眉山市'),

            ('河南省', '信阳市'),

            ('山东省', '德州市'),

            ('甘肃省', '甘南市'),

            ('云南省', '怒江市'),

            ('湖北省', '孝感市'),

            ('安徽省', '六安市'),

            ('山东省', '聊城市'),

            ('云南省', '迪庆市'),

            ('四川省', '甘孜市'),

            ('中国台湾', '基隆市'),

            ('广东省', '汕尾市'),

            ('河南省', '周口市'),

            ('广东省', '河源市'),

            ('河南省', '驻马店市'),

            ('安徽省', '宣城市'),

            ('中国台湾', '台东市'),

            ('云南省', '临沧市'),

            ('四川省', '凉山市'),

            ('湖北省', '鄂州市'),

            ('山东省', '滨州市'),

            ('河南省', '济源市'),

            ('四川省', '泸州市'),

            ('广东省', '阳江市'),

            ('山东省', '菏泽市'),

            ('中国台湾', '金门市'),

            ('安徽省', '亳州市'),

            ('中国台湾', '马祖市'),

            ('四川省', '遂宁市'),

            ('广东省', '清远市'),

            ('广东省', '潮州市'),

            ('中国台湾', '澎湖市'),

            ('广东省', '揭阳市'),

            ('广东省', '云浮市'), ]

mysql_config = {"host": "localhost", "user": "root", "password": "", "db": "test", "charset": "utf8"}
